About/Resume.tex
% Created 2016-05-18 Wed 22:29
\documentclass[a4paper, 10pt, oneside, hidelinks]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{Michael Stokley}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Michael Stokley},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.4.1 (Org mode 8.3.4)}, 
 pdflang={English}}
\begin{document}

\section*{Michael Stokley}
\label{sec:orgheadline19}
\begin{center}
\begin{tabular}{lll}
\href{mailto:michael@michaelstokley.com}{michael@michaelstokley.com} &  & \href{http://www.linkedin.com/in/mastokley}{linkedin.com/in/mastokley}\\
(303) 801-8575 &  & \href{http://github.com/mastokley}{github.com/mastokley}\\
Seattle, WA &  & \href{http://www.michaelstokley.com}{michaelstokley.com}\\
\end{tabular}
\end{center}
\subsection*{Profile}
\label{sec:orgheadline1}
Independent, self-motivated individual who places a high value on remaining engaged and challenged. As night shift data entry clerk, I involved myself in as many additional projects as possible, such as video review and 'closing misses'; as AR Specialist, I taught myself intermediate SQL, which permitted me to overhaul our billing and service history reports as well as automate or streamline many data entry / data quality processes. In both positions I greatly exceeded the expectations set by both the stated job description and by my predecessors. I look forward to meeting new challenges, growing as an employee, and contributing in a new position at your organization.
\subsection*{Technical Skills}
\label{sec:orgheadline4}
\subsubsection*{Proficient}
\label{sec:orgheadline2}
Python, Django, Pyramid, SQL, HTML/CSS, Relational Database Theory, Debian, Bash
\subsubsection*{Familiar}
\label{sec:orgheadline3}
JavaScript, jQuery, AWS Deployment, Heroku Deployment, Ansible, Postgres, Scheme
\subsection*{Education}
\label{sec:orgheadline8}
\subsubsection*{Code Fellows, Seattle, WA, 2016}
\label{sec:orgheadline5}
Certificate, Advanced Python Development
\subsubsection*{North Seattle College, Seattle, WA, 2012 - 2014}
\label{sec:orgheadline6}
Two years of math, statistics, and CS coursework
\subsubsection*{St. John's College, Annapolis, MD, 2009}
\label{sec:orgheadline7}
B. A. in Philosophy
\subsection*{Projects}
\label{sec:orgheadline12}
\subsubsection*{"Reciprocity", 2016.04}
\label{sec:orgheadline9}
\begin{itemize}
\item source at \href{http://github.com/TeamReciprocity/reciprocity}{github.com/TeamReciprocity/reciprocity}; live site at \href{http://reciprocity.michaelstokley.com}{reciprocity.michaelstokley.com}
\item < one-line description >
\item built with Django and Postgres, deployed via Ansible on an AWS EC2 instance
\item < responsibilities and accomplishments >
\item < highlight the portions of specifically owned >
\end{itemize}
\subsubsection*{"HomeQuest", 2016.03}
\label{sec:orgheadline10}
\begin{itemize}
\item web app to gamify household chores and chore management
\item manually implemented authorization, authentication as well as row-level security
\item built with Pyramid and Postgres, deployed on Heroku
\item source at \href{http://github.com/homequest}{github.com/homequest}; live site at \href{http://homequest.michaelstokley.com}{homequest.michaelstokley.com}
\end{itemize}
\subsubsection*{Learning Journal, 2016.03}
\label{sec:orgheadline11}
\begin{itemize}
\item lightweight personal blog
\item built with Pyramid and Postgres, deployed on Heroku
\item source at \href{http://github.com/mastokley/learning_journal}{github.com/mastokley/learning\_journal}; live site at \href{http://learning_journal.michaelstokley.com}{learning\_journal.michaelstokley.com}
\end{itemize}
\subsection*{Experience}
\label{sec:orgheadline18}
\subsubsection*{Recology CleanScapes}
\label{sec:orgheadline15}
\paragraph*{AR Specialist, 2012.04 - 2015.04}
\label{sec:orgheadline13}
\begin{itemize}
\item Oversaw and coordinated all billing and collections activities
\item Developed accurate, sophisticated SQL queries to capture evolving data inconsistencies. These queries eliminated \textasciitilde{}37.5 hours of labor per month despite a 126\% increase in customer accounts over two years
\item Designed database reports for internal and external customers, such as government officials and senior management
\item Delegated data entry / data revision tasks
\item Collaborated with operations, data quality, payment processing, and customer service teams to analyze and improve processes as new city contracts were won
\item Closed the month on a deadline
\end{itemize}
\paragraph*{Data Quality Specialist, 2011.07 - 2012.04}
\label{sec:orgheadline14}

Various data entry; dispatch and ‘front desk’/customer service duties for graveyard shift; reviewed truck video for misses and accidents; ‘closing’ misses; illegal dumping reporting for SPU; various clerical, reporting, and recordkeeping duties
\subsubsection*{Kojen English Language School in Taipei, Taiwan}
\label{sec:orgheadline17}
\paragraph*{ESL Teacher, 2009.10 - 2010.10}
\label{sec:orgheadline16}

Taught high energy ESL classes for children aged 5 - 18; resolved classroom conflicts; planned lessons and coordinated lesson plans with co-teachers; prepared end of class student grade reports
\end{document}